IRP/src/InformationRegisters/T1010S_ScannedBarcode/T1010S_ScannedBarcode.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T1010S_ScannedBarcode</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <resources>
  <name>Barcode</name>
  <type>
   <types>DefinedType.typeBarcode</types>
  </type>
 </resources>
 <resources>
  <name>User</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </resources>
 <resources>
  <name>Count</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>10</precision>
   </numberQualifiers>
  </type>
 </resources>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DocumentRef</types>
  </type>
 </dimensions>
 <dimensions>
  <name>InfoID</name>
  <type>
   <types>UUID</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/Barcodes/Barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>Barcodes</name>
 <resources>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </resources>
 <resources>
  <name>SerialLotNumber</name>
  <type>
   <types>CatalogRef.SerialLotNumbers</types>
  </type>
 </resources>
 <resources>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </resources>
 <resources>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <attributes>
  <name>Presentation</name>
  <type>
   <types>DefinedType.typeQR</types>
  </type>
 </attributes>
 <dimensions>
  <name>Barcode</name>
  <type>
   <types>DefinedType.typeBarcode</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/SerialLotNumbers/SerialLotNumbers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>SerialLotNumbers</name>
 <attributes>
  <name>SerialLotNumberOwner</name>
  <type>
   <types>CatalogRef.Items</types>
   <types>CatalogRef.ItemKeys</types>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Inactive</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetail</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EachSerialLotNumberIsUnique</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetail</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CodeString</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>HasRelatedSerialLotNumbers</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RelatedSerialLotNumbers</name>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/T1010S_ScannedBarcode/ManagerModule.bsl
// Save scanned barcode.
// 
// Parameters:
//  Basis - DocumentRef - Any basis document ref
//  Barcode - DefinedType.typeBarcode, Array - Array or single barcode to save 
Procedure SaveBarcode(Basis, Barcode, Quantity = 1) Export

	NewBarcode = CreateRecordManager();

	NewBarcode.InfoID = New UUID();
	NewBarcode.Period = CommonFunctionsServer.GetCurrentSessionDate();
	NewBarcode.User = SessionParameters.CurrentUser;
	NewBarcode.Basis = Basis;
	NewBarcode.Barcode = Barcode;
	NewBarcode.Count = Quantity;

	NewBarcode.Write();

EndProcedure

// Clear scanned history by basis.
// 
// Parameters:
//  Basis - DocumentRef - Any basis document ref
Procedure ClearHistoryByBasis(Basis) Export
	If Not ValueIsFilled(Basis) Then
		Return;
	EndIf;

	NewBarcodeSet = CreateRecordSet();
	NewBarcodeSet.Filter.Basis.Set(Basis);
	NewBarcodeSet.Write();

EndProcedure

// Get all scanned barcode by  basis.
// 
// Parameters:
//  Basis - DocumentRef - Any basis document ref
// 
// Returns:
//  ValueTable - All scanned barcode with Item key and Items
Function GetAllScannedBarcode(Basis) Export

	Query = New Query();
	Query.Text =
	"SELECT
	|	Barcodes.Barcode,
	|	Barcodes.ItemKey.Item AS Item,
	|	Barcodes.ItemKey,
	|	Barcodes.SerialLotNumber,
	|	Barcodes.Unit,
	|	T1010S_ScannedBarcode.Count AS ScannedQuantity
	|FROM
	|	InformationRegister.T1010S_ScannedBarcode AS T1010S_ScannedBarcode
	|		LEFT JOIN InformationRegister.Barcodes AS Barcodes
	|		ON T1010S_ScannedBarcode.Barcode = Barcodes.Barcode
	|WHERE
	|	T1010S_ScannedBarcode.Basis = &Basis";

	Query.SetParameter("Basis", Basis);

	QueryResult = Query.Execute().Unload();

	Return QueryResult;

EndFunction

// Union document and scanned data.
// 
// Parameters:
//  Basis - DocumentRef - Any basis document ref
//  CurrentOwnnerItemList - ValueTable - Current item list at form owner
//  CurrentOwnnerSerialLotNumbers - ValueTable - Current item list at form owner
// 
// Returns:
//  ValueTable - All scanned barcode with Item key and Items
Function GetCommonTable(Basis, CurrentOwnnerItemList, CurrentOwnnerSerialLotNumbers) Export

	Query = New Query();
	Query.Text =
	"SELECT
	|	Barcodes.ItemKey,
	|	Barcodes.Unit,
	|	Barcodes.SerialLotNumber,
	|	SUM(T1010S_ScannedBarcode.Count) AS ScannedQuantity
	|INTO ScannedInfo
	|FROM
	|	InformationRegister.T1010S_ScannedBarcode AS T1010S_ScannedBarcode
	|		LEFT JOIN InformationRegister.Barcodes AS Barcodes
	|		ON T1010S_ScannedBarcode.Barcode = Barcodes.Barcode
	|WHERE
	|	T1010S_ScannedBarcode.Basis = &Basis
	|GROUP BY
	|	Barcodes.ItemKey,
	|	Barcodes.Unit,
	|	Barcodes.SerialLotNumber
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ItemsList.Key,
	|	ItemsList.ItemKey,
	|	ItemsList.Quantity AS Quantity,
	|	ItemsList.Unit
	|INTO ItemsList
	|FROM
	|	&DocumentItemList AS ItemsList
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SerialLotNumbers.Key,
	|	SerialLotNumbers.SerialLotNumber,
	|	SerialLotNumbers.Quantity AS Quantity
	|INTO SerialLotNumbers
	|FROM
	|	&DocumentISerialLotNumbers AS SerialLotNumbers
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ItemsList.ItemKey,
	|	ISNULL(SerialLotNumbers.SerialLotNumber, VALUE(Catalog.SerialLotNumbers.EmptyRef)) AS SerialLotNumber,
	|	ISNULL(SerialLotNumbers.Quantity, ItemsList.Quantity) AS Quantity,
	|	ItemsList.Unit
	|INTO DocumentData
	|FROM
	|	ItemsList AS ItemsList
	|		LEFT JOIN SerialLotNumbers AS SerialLotNumbers
	|		ON ItemsList.Key = SerialLotNumbers.Key
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	DocumentData.ItemKey,
	|	DocumentData.SerialLotNumber,
	|	DocumentData.Quantity,
	|	DocumentData.Unit,
	|	0 AS ScannedQuantity
	|INTO VTAll
	|FROM
	|	DocumentData AS DocumentData
	|
	|UNION ALL
	|
	|SELECT
	|	ScannedInfo.ItemKey,
	|	ScannedInfo.SerialLotNumber,
	|	0,
	|	ScannedInfo.Unit,
	|	ScannedInfo.ScannedQuantity
	|FROM
	|	ScannedInfo AS ScannedInfo
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	VTAll.ItemKey.Item AS Item,
	|	VTAll.ItemKey,
	|	VTAll.SerialLotNumber,
	|	SUM(VTAll.Quantity) AS Quantity,
	|	VTAll.Unit,
	|	SUM(VTAll.ScannedQuantity) AS ScannedQuantity
	|FROM
	|	VTAll AS VTAll
	|GROUP BY
	|	VTAll.ItemKey.Item,
	|	VTAll.ItemKey,
	|	VTAll.SerialLotNumber,
	|	VTAll.Unit";

	Query.SetParameter("Basis", Basis);
	Query.SetParameter("DocumentItemList", CurrentOwnnerItemList);
	Query.SetParameter("DocumentISerialLotNumbers", CurrentOwnnerSerialLotNumbers);

	QueryResult = Query.Execute().Unload();

	Return QueryResult;

EndFunction
